In [100]:
from biblio_modules import load_csv_files_as_df, statistique_rapide_df
import pandas as pd
import pyarrow
import numpy as np
import matplotlib.pyplot as plt

customers_XPLO = pd.read_csv("../Source/customers.csv", sep=";")

<div style="background-color: RGB(0,150,250);" >
<h2 style="margin: auto; padding: 20px; color:#fff; "> Exploration (Pas de transformation de données) </h2>
</div>

In [89]:
print(f"les 3 colonnes de customers : {customers_XPLO.columns.to_numpy()}")
print(f" la clientèles est composé de {8621} individus")
print(f" L'année de naissance moyen est {customers_XPLO.birth.mean()} ")
print(f" le client le plus vieux est né en {customers_XPLO.birth.min()} ")
print(f" le client le plus jeune est né en {customers_XPLO.birth.max()}")

les 3 colonnes de customers : ['client_id' 'sex' 'birth']
 la clientèles est composé de 8621 individus
 L'année de naissance moyen est 1978.2756060781812
 le client le plus vieux est né en 1929
 le client le plus jeune est né en 2004

DIMENSION : 8621 rows x 3 columns

Aucune valeurs NULL

In [95]:
load_csv_files_as_df(customers_XPLO, "../Source/customers.csv", ";")

     client_id sex  birth
0       c_4410   f   1967
1       c_7839   f   1975
2       c_1699   f   1984
3       c_5961   f   1962
4       c_5320   m   1943
...        ...  ..    ...
8616    c_7920   m   1956
8617    c_7403   f   1970
8618    c_5119   m   1974
8619    c_5643   f   1968
8620      c_84   f   1982

[8621 rows x 3 columns]

In [98]:
fréquence_client_id = customers_XPLO[['client_id']].value_counts(normalize=True)
fréquence_client_id =  fréquence_client_id.to_frame().reset_index(drop=False).sort_values(by='proportion', ascending=False)
fréquence_client_id

     client_id  proportion
0          c_1    0.000116
5742    c_1014    0.000116
5756    c_1001    0.000116
5755    c_1002    0.000116
5754    c_1003    0.000116
...        ...         ...
2869     c_995    0.000116
2868     c_996    0.000116
2867     c_997    0.000116
2866     c_998    0.000116
8620     c_999    0.000116

[8621 rows x 2 columns]

In [92]:
customers_XPLO.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8621 entries, 0 to 8620
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8621 non-null   object
 1   sex        8621 non-null   object
 2   birth      8621 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

In [93]:
customers_XPLO.describe()

             birth
count  8621.000000
mean   1978.275606
std      16.917958
min    1929.000000
25%    1966.000000
50%    1979.000000
75%    1992.000000
max    2004.000000

In [94]:
customers_XPLO.loc[customers_XPLO['birth'].isnull()]

Empty DataFrame
Columns: [client_id, sex, birth]
Index: []

In [101]:
customers_XPLO.value_counts(subset='client_id').sort_values(ascending=False)

client_id
c_1       1
c_1014    1
c_1001    1
c_1002    1
c_1003    1
         ..
c_995     1
c_996     1
c_997     1
c_998     1
c_999     1
Name: count, Length: 8621, dtype: int64